### Missing Value
    +fillna,dropna

In [29]:
import pandas as pd
df=pd.read_csv("data.csv")
df

     date  sno    name               add  salary
0  1-1-19    1  sadist  chinnamusiliwada     NaN
1  2-1-19    2     NaN               NaN   100.0
2  3-1-19    3   rahul               vij   500.0
3  4-1-19    4    ravi               NaN   200.0

In [10]:
s=df.fillna(0)

In [11]:
s

     date  sno   name  add  salary
0  1-1-19    1    ram  viz     0.0
1  2-1-19    2      0    0   100.0
2  3-1-19    3  rahul  vij   500.0
3  4-1-19    4   ravi    0   200.0

In [16]:
df["name"].fillna("noname")

0       ram
1    noname
2     rahul
3      ravi
Name: name, dtype: object

In [17]:
df.fillna({
    "name":"noname",
    "add":"noadd",
    "salary":0
    
})

     date  sno    name    add  salary
0  1-1-19    1     ram    viz     0.0
1  2-1-19    2  noname  noadd   100.0
2  3-1-19    3   rahul    vij   500.0
3  4-1-19    4    ravi  noadd   200.0

In [19]:
df.dropna()

     date  sno   name  add  salary
2  3-1-19    3  rahul  vij   500.0

In [21]:
df.dropna(thresh=1)

     date  sno   name  add  salary
0  1-1-19    1    ram  viz     NaN
1  2-1-19    2    NaN  NaN   100.0
2  3-1-19    3  rahul  vij   500.0
3  4-1-19    4   ravi  NaN   200.0

In [22]:
import pandas as pd
df1=pd.read_csv("date.csv")
df1

   sno   sname              sadd  snark
0    1  sadist  chinnamusiliwada     90
1    2   psyco      maddilipalam     10
2    3   kanna       kurmanpalam     80
3    4   bujji          banglore     99

In [23]:
pd.merge(df,df1,how="outer")

     date  sno   name  add  salary   sname              sadd  snark
0  1-1-19    1    ram  viz     NaN  sadist  chinnamusiliwada     90
1  2-1-19    2    NaN  NaN   100.0   psyco      maddilipalam     10
2  3-1-19    3  rahul  vij   500.0   kanna       kurmanpalam     80
3  4-1-19    4   ravi  NaN   200.0   bujji          banglore     99

In [30]:
g=df1.groupby("sadd")
g

In [31]:
g.get_group("chinnamusiliwada")

   sno   sname              sadd  snark
0    1  sadist  chinnamusiliwada     90

In [32]:
d={
    "name":["a","b","c","d"],
    "salary":[1,2,3,4]
}
df=pd.DataFrame(d)
df

  name  salary
0    a       1
1    b       2
2    c       3
3    d       4

In [34]:
d1={
    "name":["e","f","g"],
    "salary":[5,6,7]
}
df1=pd.DataFrame(d1)
df1

  name  salary
0    e       5
1    f       6
2    g       7

In [35]:
df2=pd.concat([df,df1],ignore_index=True)
df2

  name  salary
0    a       1
1    b       2
2    c       3
3    d       4
4    e       5
5    f       6
6    g       7

In [36]:
df2=pd.concat([df,df1],ignore_index=True)
df2.set_index("name")

      salary
name
a          1
b          2
c          3
d          4
e          5
f          6
g          7

In [40]:
df2.index(a)

NameError: name 'a' is not defined